Step_3_scripts_and_AMR/small_jet_base_AMR/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

topoChanger
{
    type            refiner;

    libs            ("libfvMeshTopoChangers.so");

    mover           none;

    // How often to refine
    refineInterval  10;

    // Field to be refinement on
    field           s;

    // Refine field in between lower..upper
    //FE: cells that fall within this values get refined. Additionaly
    // cells that got refined but no longher respect this criteria
    //get unrefined
    lowerRefineLevel 0.4;
    upperRefineLevel 0.9;
    
    //FE: a bit obscure to me. Unrefines cells below this level, but is it already what
    unrefineLevl 0.01;

    // Have slower than 2:1 refinement
    nBufferLayers   2;

    // Refine cells only up to maxRefinement levels
    maxRefinement   2;

    // Stop refinement if maxCells reached
    maxCells        10000000;

    // Write the refinement level as a volScalarField
    dumpLevel       true;

    // FE: Does literally nothing execpt produce an annoying warning.
    // Use the correctPhi setting in fvSolution.
    correctFluxes (
		    (phi none)
		    (phi_0 none) 
		    (ghf none)
		  );

}

distributor
{
    type            distributor;

    libs            ("libfvMeshDistributors.so");
    redistributionInterval  20;
}

// ************************************************************************* //
